OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f753.h
/*
 * This declarations of the PIC16F753 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:22:59 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC16F753_H__
#define __PIC16F753_H__

//==============================================================================
//
//	Register Addresses
//
//==============================================================================

#ifndef NO_ADDR_DEFINES

#define INDF_ADDR               0x0000
#define TMR0_ADDR               0x0001
#define PCL_ADDR                0x0002
#define STATUS_ADDR             0x0003
#define FSR_ADDR                0x0004
#define PORTA_ADDR              0x0005
#define PORTC_ADDR              0x0007
#define IOCAF_ADDR              0x0008
#define IOCCF_ADDR              0x0009
#define PCLATH_ADDR             0x000A
#define INTCON_ADDR             0x000B
#define PIR1_ADDR               0x000C
#define PIR2_ADDR               0x000D
#define TMR1_ADDR               0x000F
#define TMR1L_ADDR              0x000F
#define TMR1H_ADDR              0x0010
#define T1CON_ADDR              0x0011
#define T1GCON_ADDR             0x0012
#define CCPR1_ADDR              0x0013
#define CCPR1L_ADDR             0x0013
#define CCPR1H_ADDR             0x0014
#define CCP1CON_ADDR            0x0015
#define ADRES_ADDR              0x001C
#define ADRESL_ADDR             0x001C
#define ADRESH_ADDR             0x001D
#define ADCON0_ADDR             0x001E
#define ADCON1_ADDR             0x001F
#define OPTION_REG_ADDR         0x0081
#define TRISA_ADDR              0x0085
#define TRISC_ADDR              0x0087
#define IOCAP_ADDR              0x0088
#define IOCCP_ADDR              0x0089
#define PIE1_ADDR               0x008C
#define PIE2_ADDR               0x008D
#define OSCCON_ADDR             0x008F
#define FVR1CON0_ADDR           0x0090
#define DAC1CON0_ADDR           0x0091
#define DAC1REFL_ADDR           0x0092
#define DAC1REFH_ADDR           0x0093
#define OPA1CON_ADDR            0x0096
#define OPA1CON0_ADDR           0x0096
#define C2CON0_ADDR             0x009B
#define CM2CON0_ADDR            0x009B
#define C2CON1_ADDR             0x009C
#define CM2CON1_ADDR            0x009C
#define C1CON0_ADDR             0x009D
#define CM1CON0_ADDR            0x009D
#define C1CON1_ADDR             0x009E
#define CM1CON1_ADDR            0x009E
#define CMOUT_ADDR              0x009F
#define MCOUT_ADDR              0x009F
#define LATA_ADDR               0x0105
#define LATC_ADDR               0x0107
#define IOCAN_ADDR              0x0108
#define IOCCN_ADDR              0x0109
#define WPUA_ADDR               0x010C
#define WPUC_ADDR               0x010D
#define SLRCONC_ADDR            0x010E
#define PCON_ADDR               0x010F
#define TMR2_ADDR               0x0110
#define PR2_ADDR                0x0111
#define T2CON_ADDR              0x0112
#define HLTMR1_ADDR             0x0113
#define HLTPR1_ADDR             0x0114
#define HLT1CON0_ADDR           0x0115
#define HLT1CON1_ADDR           0x0116
#define HLTMR2_ADDR             0x0117
#define HLTPR2_ADDR             0x0118
#define HLT2CON0_ADDR           0x0119
#define HLT2CON1_ADDR           0x011A
#define SLPC1CON0_ADDR          0x011E
#define SLPCCON0_ADDR           0x011E
#define SLPC1CON1_ADDR          0x011F
#define SLPCCON1_ADDR           0x011F
#define ANSELA_ADDR             0x0185
#define ANSELC_ADDR             0x0187
#define APFCON_ADDR             0x0188
#define OSCTUNE_ADDR            0x0189
#define PMCON1_ADDR             0x018C
#define PMCON2_ADDR             0x018D
#define PMADR_ADDR              0x018E
#define PMADRL_ADDR             0x018E
#define PMADRH_ADDR             0x018F
#define PMDAT_ADDR              0x0190
#define PMDATL_ADDR             0x0190
#define PMDATH_ADDR             0x0191
#define COG1PHR_ADDR            0x0192
#define COG1PHF_ADDR            0x0193
#define COG1BKR_ADDR            0x0194
#define COG1BKF_ADDR            0x0195
#define COG1DBR_ADDR            0x0196
#define COG1DBF_ADDR            0x0197
#define COG1CON0_ADDR           0x0198
#define COG1CON1_ADDR           0x0199
#define COG1RIS_ADDR            0x019A
#define COG1RSIM_ADDR           0x019B
#define COG1FIS_ADDR            0x019C
#define COG1FSIM_ADDR           0x019D
#define COG1ASD0_ADDR           0x019E
#define COG1ASD1_ADDR           0x019F

#endif // #ifndef NO_ADDR_DEFINES

//==============================================================================
//
//	Register Definitions
//
//==============================================================================

extern __at(0x0000) __sfr INDF;
extern __at(0x0001) __sfr TMR0;
extern __at(0x0002) __sfr PCL;

//==============================================================================
//        STATUS Bits

extern __at(0x0003) __sfr STATUS;

typedef union
  {
  struct
    {
    unsigned C                  : 1;
    unsigned DC                 : 1;
    unsigned Z                  : 1;
    unsigned NOT_PD             : 1;
    unsigned NOT_TO             : 1;
    unsigned RP0                : 1;
    unsigned RP1                : 1;
    unsigned IRP                : 1;
    };

  struct
    {
    unsigned                    : 5;
    unsigned RP                 : 2;
    unsigned                    : 1;
    };
  } __STATUSbits_t;

extern __at(0x0003) volatile __STATUSbits_t STATUSbits;

#define _C                      0x01
#define _DC                     0x02
#define _Z                      0x04
#define _NOT_PD                 0x08
#define _NOT_TO                 0x10
#define _RP0                    0x20
#define _RP1                    0x40
#define _IRP                    0x80

//==============================================================================

