OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f753.h
extern __at(0x0108) __sfr IOCAN;

typedef union
  {
  struct
    {
    unsigned IOCAN0             : 1;
    unsigned IOCAN1             : 1;
    unsigned IOCAN2             : 1;
    unsigned IOCAN3             : 1;
    unsigned IOCAN4             : 1;
    unsigned IOCAN5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned IOCAN              : 6;
    unsigned                    : 2;
    };
  } __IOCANbits_t;

extern __at(0x0108) volatile __IOCANbits_t IOCANbits;

#define _IOCAN0                 0x01
#define _IOCAN1                 0x02
#define _IOCAN2                 0x04
#define _IOCAN3                 0x08
#define _IOCAN4                 0x10
#define _IOCAN5                 0x20

//==============================================================================


//==============================================================================
//        IOCCN Bits

extern __at(0x0109) __sfr IOCCN;

typedef union
  {
  struct
    {
    unsigned IOCCN0             : 1;
    unsigned IOCCN1             : 1;
    unsigned IOCCN2             : 1;
    unsigned IOCCN3             : 1;
    unsigned IOCCN4             : 1;
    unsigned IOCCN5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned IOCCN              : 6;
    unsigned                    : 2;
    };
  } __IOCCNbits_t;

extern __at(0x0109) volatile __IOCCNbits_t IOCCNbits;

#define _IOCCN0                 0x01
#define _IOCCN1                 0x02
#define _IOCCN2                 0x04
#define _IOCCN3                 0x08
#define _IOCCN4                 0x10
#define _IOCCN5                 0x20

//==============================================================================


//==============================================================================
//        WPUA Bits

extern __at(0x010C) __sfr WPUA;

typedef union
  {
  struct
    {
    unsigned WPUA0              : 1;
    unsigned WPUA1              : 1;
    unsigned WPUA2              : 1;
    unsigned WPUA3              : 1;
    unsigned WPUA4              : 1;
    unsigned WPUA5              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned WPUA               : 6;
    unsigned                    : 2;
    };
  } __WPUAbits_t;

extern __at(0x010C) volatile __WPUAbits_t WPUAbits;

#define _WPUA0                  0x01
#define _WPUA1                  0x02
#define _WPUA2                  0x04
#define _WPUA3                  0x08
#define _WPUA4                  0x10
#define _WPUA5                  0x20

//==============================================================================


//==============================================================================
//        WPUC Bits

extern __at(0x010D) __sfr WPUC;

typedef union
  {
  struct
    {
    unsigned WPUC0              : 1;
    unsigned WPUC1              : 1;
    unsigned WPUC2              : 1;
    unsigned WPUC3              : 1;
    unsigned WPUC4              : 1;
    unsigned WPUC5              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned WPUC               : 6;
    unsigned                    : 2;
    };
  } __WPUCbits_t;

extern __at(0x010D) volatile __WPUCbits_t WPUCbits;

#define _WPUC0                  0x01
#define _WPUC1                  0x02
#define _WPUC2                  0x04
#define _WPUC3                  0x08
#define _WPUC4                  0x10
#define _WPUC5                  0x20

//==============================================================================


//==============================================================================
//        SLRCONC Bits

extern __at(0x010E) __sfr SLRCONC;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned SLRC4                : 1;
  unsigned SLRC5                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __SLRCONCbits_t;

extern __at(0x010E) volatile __SLRCONCbits_t SLRCONCbits;

#define _SLRC4                  0x10
#define _SLRC5                  0x20

//==============================================================================


//==============================================================================
//        PCON Bits

extern __at(0x010F) __sfr PCON;

typedef struct
  {
  unsigned NOT_BOR              : 1;
  unsigned NOT_POR              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PCONbits_t;

extern __at(0x010F) volatile __PCONbits_t PCONbits;

#define _NOT_BOR                0x01
#define _NOT_POR                0x02

//==============================================================================

extern __at(0x0110) __sfr TMR2;
extern __at(0x0111) __sfr PR2;

//==============================================================================
//        T2CON Bits

extern __at(0x0112) __sfr T2CON;

typedef union
  {
  struct
    {
    unsigned T2CKPS0            : 1;
    unsigned T2CKPS1            : 1;
    unsigned TMR2ON             : 1;
    unsigned T2OUTPS0           : 1;
    unsigned T2OUTPS1           : 1;
    unsigned T2OUTPS2           : 1;
    unsigned T2OUTPS3           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T2CKPS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned T2OUTPS            : 4;
    unsigned                    : 1;
    };
  } __T2CONbits_t;

extern __at(0x0112) volatile __T2CONbits_t T2CONbits;

#define _T2CKPS0                0x01
#define _T2CKPS1                0x02
#define _TMR2ON                 0x04
#define _T2OUTPS0               0x08
#define _T2OUTPS1               0x10
#define _T2OUTPS2               0x20
#define _T2OUTPS3               0x40

//==============================================================================

extern __at(0x0113) __sfr HLTMR1;
extern __at(0x0114) __sfr HLTPR1;

//==============================================================================
//        HLT1CON0 Bits

extern __at(0x0115) __sfr HLT1CON0;

typedef union
  {
  struct
    {
    unsigned H1CKPS0            : 1;
    unsigned H1CKPS1            : 1;
    unsigned H1ON               : 1;
    unsigned H1OUTPS0           : 1;
    unsigned H1OUTPS1           : 1;
    unsigned H1OUTPS2           : 1;
    unsigned H1OUTPS3           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned H1CKPS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned H1OUTPS            : 4;
    unsigned                    : 1;
    };
  } __HLT1CON0bits_t;

extern __at(0x0115) volatile __HLT1CON0bits_t HLT1CON0bits;

#define _H1CKPS0                0x01
#define _H1CKPS1                0x02
#define _H1ON                   0x04
#define _H1OUTPS0               0x08
#define _H1OUTPS1               0x10
#define _H1OUTPS2               0x20
#define _H1OUTPS3               0x40

//==============================================================================


//==============================================================================
//        HLT1CON1 Bits

extern __at(0x0116) __sfr HLT1CON1;

typedef union
  {
  struct
    {
    unsigned H1REREN            : 1;
    unsigned H1FEREN            : 1;
    unsigned H1ERS0             : 1;
    unsigned H1ERS1             : 1;
    unsigned H1ERS2             : 1;
    unsigned                    : 1;
    unsigned H1RES              : 1;
    unsigned H1FES              : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned H1ERS              : 3;
    unsigned                    : 3;
    };
  } __HLT1CON1bits_t;

extern __at(0x0116) volatile __HLT1CON1bits_t HLT1CON1bits;

