OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f753.h
#define _H1REREN                0x01
#define _H1FEREN                0x02
#define _H1ERS0                 0x04
#define _H1ERS1                 0x08
#define _H1ERS2                 0x10
#define _H1RES                  0x40
#define _H1FES                  0x80

//==============================================================================

extern __at(0x0117) __sfr HLTMR2;
extern __at(0x0118) __sfr HLTPR2;

//==============================================================================
//        HLT2CON0 Bits

extern __at(0x0119) __sfr HLT2CON0;

typedef union
  {
  struct
    {
    unsigned H2CKPS0            : 1;
    unsigned H2CKPS1            : 1;
    unsigned H2ON               : 1;
    unsigned H2OUTPS0           : 1;
    unsigned H2OUTPS1           : 1;
    unsigned H2OUTPS2           : 1;
    unsigned H2OUTPS3           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned H2CKPS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned H2OUTPS            : 4;
    unsigned                    : 1;
    };
  } __HLT2CON0bits_t;

extern __at(0x0119) volatile __HLT2CON0bits_t HLT2CON0bits;

#define _H2CKPS0                0x01
#define _H2CKPS1                0x02
#define _H2ON                   0x04
#define _H2OUTPS0               0x08
#define _H2OUTPS1               0x10
#define _H2OUTPS2               0x20
#define _H2OUTPS3               0x40

//==============================================================================


//==============================================================================
//        HLT2CON1 Bits

extern __at(0x011A) __sfr HLT2CON1;

typedef union
  {
  struct
    {
    unsigned H2REREN            : 1;
    unsigned H2FEREN            : 1;
    unsigned H2ERS0             : 1;
    unsigned H2ERS1             : 1;
    unsigned H2ERS2             : 1;
    unsigned                    : 1;
    unsigned H2RES              : 1;
    unsigned H2FES              : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned H2ERS              : 3;
    unsigned                    : 3;
    };
  } __HLT2CON1bits_t;

extern __at(0x011A) volatile __HLT2CON1bits_t HLT2CON1bits;

#define _H2REREN                0x01
#define _H2FEREN                0x02
#define _H2ERS0                 0x04
#define _H2ERS1                 0x08
#define _H2ERS2                 0x10
#define _H2RES                  0x40
#define _H2FES                  0x80

//==============================================================================


//==============================================================================
//        SLPC1CON0 Bits

extern __at(0x011E) __sfr SLPC1CON0;

typedef union
  {
  struct
    {
    unsigned SC1INS             : 1;
    unsigned                    : 1;
    unsigned SCS1TSS0           : 1;
    unsigned SCS1TSS1           : 1;
    unsigned SC1POL             : 1;
    unsigned SC1MRPE            : 1;
    unsigned                    : 1;
    unsigned SC1EN              : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned SCS1TSS            : 2;
    unsigned                    : 4;
    };
  } __SLPC1CON0bits_t;

extern __at(0x011E) volatile __SLPC1CON0bits_t SLPC1CON0bits;

#define _SC1INS                 0x01
#define _SCS1TSS0               0x04
#define _SCS1TSS1               0x08
#define _SC1POL                 0x10
#define _SC1MRPE                0x20
#define _SC1EN                  0x80

//==============================================================================


//==============================================================================
//        SLPCCON0 Bits

extern __at(0x011E) __sfr SLPCCON0;

typedef union
  {
  struct
    {
    unsigned SC1INS             : 1;
    unsigned                    : 1;
    unsigned SCS1TSS0           : 1;
    unsigned SCS1TSS1           : 1;
    unsigned SC1POL             : 1;
    unsigned SC1MRPE            : 1;
    unsigned                    : 1;
    unsigned SC1EN              : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned SCS1TSS            : 2;
    unsigned                    : 4;
    };
  } __SLPCCON0bits_t;

extern __at(0x011E) volatile __SLPCCON0bits_t SLPCCON0bits;

#define _SLPCCON0_SC1INS        0x01
#define _SLPCCON0_SCS1TSS0      0x04
#define _SLPCCON0_SCS1TSS1      0x08
#define _SLPCCON0_SC1POL        0x10
#define _SLPCCON0_SC1MRPE       0x20
#define _SLPCCON0_SC1EN         0x80

//==============================================================================


//==============================================================================
//        SLPC1CON1 Bits

extern __at(0x011F) __sfr SLPC1CON1;

typedef union
  {
  struct
    {
    unsigned SC1ISET0           : 1;
    unsigned SC1ISET1           : 1;
    unsigned SC1ISET2           : 1;
    unsigned SC1ISET3           : 1;
    unsigned SC1RNG             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SC1ISET            : 4;
    unsigned                    : 4;
    };
  } __SLPC1CON1bits_t;

extern __at(0x011F) volatile __SLPC1CON1bits_t SLPC1CON1bits;

#define _SC1ISET0               0x01
#define _SC1ISET1               0x02
#define _SC1ISET2               0x04
#define _SC1ISET3               0x08
#define _SC1RNG                 0x10

//==============================================================================


//==============================================================================
//        SLPCCON1 Bits

extern __at(0x011F) __sfr SLPCCON1;

typedef union
  {
  struct
    {
    unsigned SC1ISET0           : 1;
    unsigned SC1ISET1           : 1;
    unsigned SC1ISET2           : 1;
    unsigned SC1ISET3           : 1;
    unsigned SC1RNG             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SC1ISET            : 4;
    unsigned                    : 4;
    };
  } __SLPCCON1bits_t;

extern __at(0x011F) volatile __SLPCCON1bits_t SLPCCON1bits;

#define _SLPCCON1_SC1ISET0      0x01
#define _SLPCCON1_SC1ISET1      0x02
#define _SLPCCON1_SC1ISET2      0x04
#define _SLPCCON1_SC1ISET3      0x08
#define _SLPCCON1_SC1RNG        0x10

//==============================================================================


//==============================================================================
//        ANSELA Bits

