OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f753.h
#define _G1BKR0                 0x01
#define _G1BKR1                 0x02
#define _G1BKR2                 0x04
#define _G1BKR3                 0x08

//==============================================================================


//==============================================================================
//        COG1BKF Bits

extern __at(0x0195) __sfr COG1BKF;

typedef union
  {
  struct
    {
    unsigned G1BKF0             : 1;
    unsigned G1BKF1             : 1;
    unsigned G1BKF2             : 1;
    unsigned G1BKF3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1BKF              : 4;
    unsigned                    : 4;
    };
  } __COG1BKFbits_t;

extern __at(0x0195) volatile __COG1BKFbits_t COG1BKFbits;

#define _G1BKF0                 0x01
#define _G1BKF1                 0x02
#define _G1BKF2                 0x04
#define _G1BKF3                 0x08

//==============================================================================


//==============================================================================
//        COG1DBR Bits

extern __at(0x0196) __sfr COG1DBR;

typedef union
  {
  struct
    {
    unsigned G1DBR0             : 1;
    unsigned G1DBR1             : 1;
    unsigned G1DBR2             : 1;
    unsigned G1DBR3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1DBR              : 4;
    unsigned                    : 4;
    };
  } __COG1DBRbits_t;

extern __at(0x0196) volatile __COG1DBRbits_t COG1DBRbits;

#define _G1DBR0                 0x01
#define _G1DBR1                 0x02
#define _G1DBR2                 0x04
#define _G1DBR3                 0x08

//==============================================================================


//==============================================================================
//        COG1DBF Bits

extern __at(0x0197) __sfr COG1DBF;

typedef union
  {
  struct
    {
    unsigned G1DBF0             : 1;
    unsigned G1DBF1             : 1;
    unsigned G1DBF2             : 1;
    unsigned G1DBF3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1DBF              : 4;
    unsigned                    : 4;
    };
  } __COG1DBFbits_t;

extern __at(0x0197) volatile __COG1DBFbits_t COG1DBFbits;

#define _G1DBF0                 0x01
#define _G1DBF1                 0x02
#define _G1DBF2                 0x04
#define _G1DBF3                 0x08

//==============================================================================


//==============================================================================
//        COG1CON0 Bits

extern __at(0x0198) __sfr COG1CON0;

typedef union
  {
  struct
    {
    unsigned G1MD               : 1;
    unsigned                    : 1;
    unsigned G1LD               : 1;
    unsigned G1POL0             : 1;
    unsigned G1POL1             : 1;
    unsigned G1OE0              : 1;
    unsigned G1OE1              : 1;
    unsigned G1EN               : 1;
    };

  struct
    {
    unsigned                    : 3;
    unsigned G1POL              : 2;
    unsigned                    : 3;
    };

  struct
    {
    unsigned                    : 5;
    unsigned G1OE               : 2;
    unsigned                    : 1;
    };
  } __COG1CON0bits_t;

extern __at(0x0198) volatile __COG1CON0bits_t COG1CON0bits;

#define _G1MD                   0x01
#define _G1LD                   0x04
#define _G1POL0                 0x08
#define _G1POL1                 0x10
#define _G1OE0                  0x20
#define _G1OE1                  0x40
#define _G1EN                   0x80

//==============================================================================


//==============================================================================
//        COG1CON1 Bits

extern __at(0x0199) __sfr COG1CON1;

typedef union
  {
  struct
    {
    unsigned G1CS0              : 1;
    unsigned G1CS1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned G1FDBTS            : 1;
    unsigned G1RDBTS            : 1;
    };

  struct
    {
    unsigned G1CS               : 2;
    unsigned                    : 6;
    };
  } __COG1CON1bits_t;

extern __at(0x0199) volatile __COG1CON1bits_t COG1CON1bits;

#define _G1CS0                  0x01
#define _G1CS1                  0x02
#define _G1FDBTS                0x40
#define _G1RDBTS                0x80

//==============================================================================


//==============================================================================
//        COG1RIS Bits

extern __at(0x019A) __sfr COG1RIS;

typedef struct
  {
  unsigned G1RIC1               : 1;
  unsigned G1RIC2               : 1;
  unsigned C1RICCP1             : 1;
  unsigned G1RIFLT              : 1;
  unsigned G1RIT2M              : 1;
  unsigned G1R1HLT1             : 1;
  unsigned G1RIHLT2             : 1;
  unsigned                      : 1;
  } __COG1RISbits_t;

extern __at(0x019A) volatile __COG1RISbits_t COG1RISbits;

#define _G1RIC1                 0x01
#define _G1RIC2                 0x02
#define _C1RICCP1               0x04
#define _G1RIFLT                0x08
#define _G1RIT2M                0x10
#define _G1R1HLT1               0x20
#define _G1RIHLT2               0x40

//==============================================================================


//==============================================================================
//        COG1RSIM Bits

extern __at(0x019B) __sfr COG1RSIM;

typedef struct
  {
  unsigned G1RMC1               : 1;
  unsigned G1RMC2               : 1;
  unsigned G1RMCCP1             : 1;
  unsigned G1RMFLT              : 1;
  unsigned G1RTM2M              : 1;
  unsigned G1RMHLT1             : 1;
  unsigned G1RMHLT2             : 1;
  unsigned                      : 1;
  } __COG1RSIMbits_t;

