OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f753.h
extern __at(0x019B) volatile __COG1RSIMbits_t COG1RSIMbits;

#define _G1RMC1                 0x01
#define _G1RMC2                 0x02
#define _G1RMCCP1               0x04
#define _G1RMFLT                0x08
#define _G1RTM2M                0x10
#define _G1RMHLT1               0x20
#define _G1RMHLT2               0x40

//==============================================================================


//==============================================================================
//        COG1FIS Bits

extern __at(0x019C) __sfr COG1FIS;

typedef struct
  {
  unsigned G1FIC1               : 1;
  unsigned G1FIC2               : 1;
  unsigned G1FICCP1             : 1;
  unsigned G1FIFLT              : 1;
  unsigned G1FIT2M              : 1;
  unsigned G1FIHLT1             : 1;
  unsigned G1FIHLT2             : 1;
  unsigned                      : 1;
  } __COG1FISbits_t;

extern __at(0x019C) volatile __COG1FISbits_t COG1FISbits;

#define _G1FIC1                 0x01
#define _G1FIC2                 0x02
#define _G1FICCP1               0x04
#define _G1FIFLT                0x08
#define _G1FIT2M                0x10
#define _G1FIHLT1               0x20
#define _G1FIHLT2               0x40

//==============================================================================


//==============================================================================
//        COG1FSIM Bits

extern __at(0x019D) __sfr COG1FSIM;

typedef struct
  {
  unsigned G1FMC1               : 1;
  unsigned G1FMC2               : 1;
  unsigned G1FMCCP1             : 1;
  unsigned G1FMFLT              : 1;
  unsigned G1FMT2M              : 1;
  unsigned G1FMHLT1             : 1;
  unsigned G1FMHLT2             : 1;
  unsigned                      : 1;
  } __COG1FSIMbits_t;

extern __at(0x019D) volatile __COG1FSIMbits_t COG1FSIMbits;

#define _G1FMC1                 0x01
#define _G1FMC2                 0x02
#define _G1FMCCP1               0x04
#define _G1FMFLT                0x08
#define _G1FMT2M                0x10
#define _G1FMHLT1               0x20
#define _G1FMHLT2               0x40

//==============================================================================


//==============================================================================
//        COG1ASD0 Bits

extern __at(0x019E) __sfr COG1ASD0;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned G1ASD0L0           : 1;
    unsigned G1ASD0L1           : 1;
    unsigned G1ASD1L0           : 1;
    unsigned G1ASD1L1           : 1;
    unsigned G1ARSEN            : 1;
    unsigned G1ASDE             : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned G1ASD0L            : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned G1ASD1L            : 2;
    unsigned                    : 2;
    };
  } __COG1ASD0bits_t;

extern __at(0x019E) volatile __COG1ASD0bits_t COG1ASD0bits;

#define _G1ASD0L0               0x04
#define _G1ASD0L1               0x08
#define _G1ASD1L0               0x10
#define _G1ASD1L1               0x20
#define _G1ARSEN                0x40
#define _G1ASDE                 0x80

//==============================================================================


//==============================================================================
//        COG1ASD1 Bits

extern __at(0x019F) __sfr COG1ASD1;

typedef struct
  {
  unsigned G1ASDSFLT            : 1;
  unsigned G1ASDSC1             : 1;
  unsigned G1ASDSC2             : 1;
  unsigned G1ASDSHLT1           : 1;
  unsigned G1ASDSHLT2           : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __COG1ASD1bits_t;

extern __at(0x019F) volatile __COG1ASD1bits_t COG1ASD1bits;

#define _G1ASDSFLT              0x01
#define _G1ASDSC1               0x02
#define _G1ASDSC2               0x04
#define _G1ASDSHLT1             0x08
#define _G1ASDSHLT2             0x10

//==============================================================================


//==============================================================================
//
//        Configuration Bits
//
//==============================================================================

#define _CONFIG                 0x2007

//----------------------------- CONFIG Options -------------------------------

#define _FOSC0_INT              0x3FFE  // Internal oscillator mode.  I/O function on RA5/CLKIN.
#define _FOSC0_EC               0x3FFF  // EC oscillator mode.  CLKIN function on RA5/CLKIN.
#define _WDTE_OFF               0x3FF7  // Watchdog Timer disabled.
#define _WDTE_ON                0x3FFF  // Watchdog Timer enabled.
#define _PWRTE_ON               0x3FEF  // Power-up Timer enabled.
#define _PWRTE_OFF              0x3FFF  // Power-up Timer disabled.
#define _MCLRE_OFF              0x3FDF  // MCLR pin is alternate function.
#define _MCLRE_ON               0x3FFF  // MCLR pin is MCLR function with internal weak pullup.
#define _CP_ON                  0x3FBF  // Program memory code protection is enabled.
#define _CP_OFF                 0x3FFF  // Program memory code protection is disabled.
#define _BOREN_DIS              0x3CFF  // BOR disabled.
#define _BOREN_SLEEP_DIS        0x3EFF  // BOR enabled during operation and disabled in Sleep.
#define _BOREN_EN               0x3FFF  // BOR enabled.
#define _WRT_ALL                0x33FF  // 000h to 3FFh self-write protected.
#define _WRT_HALF               0x37FF  // 000h to 1FFh self-write protected.
#define _WRT_FOURTH             0x3BFF  // 000h to 0FFh self-write protected.
#define _WRT_OFF                0x3FFF  // Flash self-write protection off.
#define _CLKOUTEN_ON            0x2FFF  // CLKOUT function enabled.  CLKOUT pin is CLKOUT.
#define _CLKOUTEN_OFF           0x3FFF  // CLKOUT function disabled.  CLKOUT pin acts as I/O.

//==============================================================================

#define _DEVID1                 0x2006

#define _IDLOC0                 0x2000
#define _IDLOC1                 0x2001
#define _IDLOC2                 0x2002
#define _IDLOC3                 0x2003

//==============================================================================

