OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f753.h
#define G1FIC1                  COG1FISbits.G1FIC1              // bit 0
#define G1FIC2                  COG1FISbits.G1FIC2              // bit 1
#define G1FICCP1                COG1FISbits.G1FICCP1            // bit 2
#define G1FIFLT                 COG1FISbits.G1FIFLT             // bit 3
#define G1FIT2M                 COG1FISbits.G1FIT2M             // bit 4
#define G1FIHLT1                COG1FISbits.G1FIHLT1            // bit 5
#define G1FIHLT2                COG1FISbits.G1FIHLT2            // bit 6

#define G1FMC1                  COG1FSIMbits.G1FMC1             // bit 0
#define G1FMC2                  COG1FSIMbits.G1FMC2             // bit 1
#define G1FMCCP1                COG1FSIMbits.G1FMCCP1           // bit 2
#define G1FMFLT                 COG1FSIMbits.G1FMFLT            // bit 3
#define G1FMT2M                 COG1FSIMbits.G1FMT2M            // bit 4
#define G1FMHLT1                COG1FSIMbits.G1FMHLT1           // bit 5
#define G1FMHLT2                COG1FSIMbits.G1FMHLT2           // bit 6

#define G1PHF0                  COG1PHFbits.G1PHF0              // bit 0
#define G1PHF1                  COG1PHFbits.G1PHF1              // bit 1
#define G1PHF2                  COG1PHFbits.G1PHF2              // bit 2
#define G1PHF3                  COG1PHFbits.G1PHF3              // bit 3

#define G1PHR0                  COG1PHRbits.G1PHR0              // bit 0
#define G1PHR1                  COG1PHRbits.G1PHR1              // bit 1
#define G1PHR2                  COG1PHRbits.G1PHR2              // bit 2
#define G1PHR3                  COG1PHRbits.G1PHR3              // bit 3

#define G1RIC1                  COG1RISbits.G1RIC1              // bit 0
#define G1RIC2                  COG1RISbits.G1RIC2              // bit 1
#define C1RICCP1                COG1RISbits.C1RICCP1            // bit 2
#define G1RIFLT                 COG1RISbits.G1RIFLT             // bit 3
#define G1RIT2M                 COG1RISbits.G1RIT2M             // bit 4
#define G1R1HLT1                COG1RISbits.G1R1HLT1            // bit 5
#define G1RIHLT2                COG1RISbits.G1RIHLT2            // bit 6

#define G1RMC1                  COG1RSIMbits.G1RMC1             // bit 0
#define G1RMC2                  COG1RSIMbits.G1RMC2             // bit 1
#define G1RMCCP1                COG1RSIMbits.G1RMCCP1           // bit 2
#define G1RMFLT                 COG1RSIMbits.G1RMFLT            // bit 3
#define G1RTM2M                 COG1RSIMbits.G1RTM2M            // bit 4
#define G1RMHLT1                COG1RSIMbits.G1RMHLT1           // bit 5
#define G1RMHLT2                COG1RSIMbits.G1RMHLT2           // bit 6

#define DACPSS0                 DAC1CON0bits.DACPSS0            // bit 2
#define DACPSS1                 DAC1CON0bits.DACPSS1            // bit 3
#define DACOE                   DAC1CON0bits.DACOE              // bit 5
#define DACFM                   DAC1CON0bits.DACFM              // bit 6
#define DACEN                   DAC1CON0bits.DACEN              // bit 7

#define FVRBUFEN                FVR1CON0bits.FVRBUFEN           // bit 0
#define FVRBUSS0                FVR1CON0bits.FVRBUSS0           // bit 3
#define FVRBUSS1                FVR1CON0bits.FVRBUSS1           // bit 4
#define FVROE                   FVR1CON0bits.FVROE              // bit 5
#define FVRRDY                  FVR1CON0bits.FVRRDY             // bit 6
#define FVREN                   FVR1CON0bits.FVREN              // bit 7

#define H1CKPS0                 HLT1CON0bits.H1CKPS0            // bit 0
#define H1CKPS1                 HLT1CON0bits.H1CKPS1            // bit 1
#define H1ON                    HLT1CON0bits.H1ON               // bit 2
#define H1OUTPS0                HLT1CON0bits.H1OUTPS0           // bit 3
#define H1OUTPS1                HLT1CON0bits.H1OUTPS1           // bit 4
#define H1OUTPS2                HLT1CON0bits.H1OUTPS2           // bit 5
#define H1OUTPS3                HLT1CON0bits.H1OUTPS3           // bit 6

#define H1REREN                 HLT1CON1bits.H1REREN            // bit 0
#define H1FEREN                 HLT1CON1bits.H1FEREN            // bit 1
#define H1ERS0                  HLT1CON1bits.H1ERS0             // bit 2
#define H1ERS1                  HLT1CON1bits.H1ERS1             // bit 3
#define H1ERS2                  HLT1CON1bits.H1ERS2             // bit 4
#define H1RES                   HLT1CON1bits.H1RES              // bit 6
#define H1FES                   HLT1CON1bits.H1FES              // bit 7

#define H2CKPS0                 HLT2CON0bits.H2CKPS0            // bit 0
#define H2CKPS1                 HLT2CON0bits.H2CKPS1            // bit 1
#define H2ON                    HLT2CON0bits.H2ON               // bit 2
#define H2OUTPS0                HLT2CON0bits.H2OUTPS0           // bit 3
#define H2OUTPS1                HLT2CON0bits.H2OUTPS1           // bit 4
#define H2OUTPS2                HLT2CON0bits.H2OUTPS2           // bit 5
#define H2OUTPS3                HLT2CON0bits.H2OUTPS3           // bit 6

#define H2REREN                 HLT2CON1bits.H2REREN            // bit 0
#define H2FEREN                 HLT2CON1bits.H2FEREN            // bit 1
#define H2ERS0                  HLT2CON1bits.H2ERS0             // bit 2
#define H2ERS1                  HLT2CON1bits.H2ERS1             // bit 3
#define H2ERS2                  HLT2CON1bits.H2ERS2             // bit 4
#define H2RES                   HLT2CON1bits.H2RES              // bit 6
#define H2FES                   HLT2CON1bits.H2FES              // bit 7

#define IOCIF                   INTCONbits.IOCIF                // bit 0
#define INTF                    INTCONbits.INTF                 // bit 1
#define T0IF                    INTCONbits.T0IF                 // bit 2
#define IOCIE                   INTCONbits.IOCIE                // bit 3
#define INTE                    INTCONbits.INTE                 // bit 4
#define T0IE                    INTCONbits.T0IE                 // bit 5
#define PEIE                    INTCONbits.PEIE                 // bit 6
#define GIE                     INTCONbits.GIE                  // bit 7

#define IOCAF0                  IOCAFbits.IOCAF0                // bit 0
#define IOCAF1                  IOCAFbits.IOCAF1                // bit 1
#define IOCAF2                  IOCAFbits.IOCAF2                // bit 2
#define IOCAF3                  IOCAFbits.IOCAF3                // bit 3
#define IOCAF4                  IOCAFbits.IOCAF4                // bit 4
#define IOCAF5                  IOCAFbits.IOCAF5                // bit 5

